import type { ComponentProps } from "react"
import { StoreInfo } from "./store-info"

const props: ComponentProps<typeof StoreInfo> = {
  name: "مگیران برگر",
  logo: "https://cdn.snappfood.ir/300x200/cdn/vendor_sub_types/7/01.jpg",
  type: "رستوران",
  rating: {
    value: 3.6,
    count: 12366,
    range: 5,
  },
}

export const StoreCardDefault = () => {
  return <StoreInfo {...props}></StoreInfo>
}

export const Constrained = () => {
  return (
    <div style={{ width: "300px" }}>
      <StoreInfo {...props}></StoreInfo>
    </div>
  )
}

export const WithLongNameConstrained = () => {
  const withLongName = {
    ...props,
    name: 'مگیران برگر"مگیران برگر"مگیران بمگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"رگر"مگیران برگر"مگیران برگر',
  }
  return (
    <div style={{ width: "300px" }}>
      <StoreInfo {...withLongName}></StoreInfo>
    </div>
  )
}

export const WithLongName = () => {
  const withLongName = {
    ...props,
    name: 'مگیران برگر"مگیران برگر"مگیران بمگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"مگیران برگر"رگر"مگیران برگر"مگیران برگر',
  }
  return <StoreInfo {...withLongName}></StoreInfo>
}
